; domain
(define (domain depots)
  (:requirements :typing :strips)
  (:types
    place - object
    depot distributor - place
    locatable - object
    truck hoist surface - locatable
    pallet crate - surface
  )

  (:predicates
    (at ?obj - locatable ?p - place)
    (on ?c - crate ?s - surface)
    (in ?c - crate ?t - truck)
    (lifting ?h - hoist ?c - crate)
    (available ?h - hoist)
    (clear ?s - surface)
  )

  (:action drive
    :parameters (?t - truck ?from - place ?to - place)
    :precondition (at ?t ?from)
    :effect (and
      (not (at ?t ?from))
      (at ?t ?to)
    )
  )

  (:action lift
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?c ?p)
      (at ?s ?p)
      (on ?c ?s)
      (clear ?c)
      (available ?h)
    )
    :effect (and
      (not (at ?c ?p))
      (not (available ?h))
      (not (on ?c ?s))
      (not (clear ?c))
      (lifting ?h ?c)
      (clear ?s)
    )
  )

  (:action drop
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?s ?p)
      (clear ?s)
      (lifting ?h ?c)
    )
    :effect (and
      (at ?c ?p)
      (available ?h)
      (on ?c ?s)
      (not (lifting ?h ?c))
      (not (clear ?s))
      (clear ?c)
    )
  )

  (:action load
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (lifting ?h ?c)
    )
    :effect (and
      (not (lifting ?h ?c))
      (in ?c ?t)
      (available ?h)
    )
  )

  (:action unload
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (available ?h)
      (in ?c ?t)
    )
    :effect (and
      (not (available ?h))
      (not (in ?c ?t))
      (lifting ?h ?c)
    )
  )
)

; problem
(define (problem depot-1-1-1-4-2-4) (:domain depots)
(:objects
	depot0 - Depot
	distributor0 - Distributor
	truck0 - Truck
	pallet0 pallet1 pallet2 pallet3 - Pallet
	crate0 crate1 crate2 crate3 - Crate
	hoist0 hoist1 - Hoist)
(:init
	(at pallet0 depot0)
	(clear crate2)
	(at pallet1 distributor0)
	(clear pallet1)
	(at pallet2 depot0)
	(clear crate0)
	(at pallet3 depot0)
	(clear crate3)
	(at truck0 distributor0)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 distributor0)
	(available hoist1)
	(at crate0 depot0)
	(on crate0 pallet2)
	(at crate1 depot0)
	(on crate1 pallet0)
	(at crate2 depot0)
	(on crate2 crate1)
	(at crate3 depot0)
	(on crate3 pallet3)
)

(:goal (and
		(on crate0 crate3)
		(on crate1 crate2)
		(on crate2 pallet3)
		(on crate3 pallet2)
	)
))

; plan
1. (lift hoist0 crate0 pallet2 depot0)
   deleted: (at crate0 depot0) (available hoist0) (on crate0 pallet2) (clear crate0)
   added: (lifting hoist0 crate0) (clear pallet2)
   goals met: 0 of 4
2. (drop hoist0 crate0 crate2 depot0)
   deleted: (lifting hoist0 crate0) (clear crate2)
   added: (at crate0 depot0) (available hoist0) (on crate0 crate2) (clear crate0)
   goals met: 0 of 4
3. (lift hoist0 crate3 pallet3 depot0)
   deleted: (at crate3 depot0) (available hoist0) (on crate3 pallet3) (clear crate3)
   added: (lifting hoist0 crate3) (clear pallet3)
   goals met: 0 of 4
4. (drop hoist0 crate3 pallet2 depot0)
   deleted: (lifting hoist0 crate3) (clear pallet2)
   added: (at crate3 depot0) (available hoist0) (on crate3 pallet2) (clear crate3)
   goals met: 1 of 4
5. (lift hoist0 crate0 crate2 depot0)
   deleted: (at crate0 depot0) (available hoist0) (on crate0 crate2) (clear crate0)
   added: (lifting hoist0 crate0) (clear crate2)
   goals met: 1 of 4
6. (drop hoist0 crate0 crate3 depot0)
   deleted: (lifting hoist0 crate0) (clear crate3)
   added: (at crate0 depot0) (available hoist0) (on crate0 crate3) (clear crate0)
   goals met: 2 of 4
7. (lift hoist0 crate2 crate1 depot0)
   deleted: (at crate2 depot0) (available hoist0) (on crate2 crate1) (clear crate2)
   added: (lifting hoist0 crate2) (clear crate1)
   goals met: 2 of 4
8. (drop hoist0 crate2 pallet3 depot0)
   deleted: (lifting hoist0 crate2) (clear pallet3)
   added: (at crate2 depot0) (available hoist0) (on crate2 pallet3) (clear crate2)
   goals met: 3 of 4
9. (lift hoist0 crate1 pallet0 depot0)
   deleted: (at crate1 depot0) (available hoist0) (on crate1 pallet0) (clear crate1)
   added: (lifting hoist0 crate1) (clear pallet0)
   goals met: 3 of 4
10. (drop hoist0 crate1 crate2 depot0)
   deleted: (lifting hoist0 crate1) (clear crate2)
   added: (at crate1 depot0) (available hoist0) (on crate1 crate2) (clear crate1)
   goals met: 4 of 4
